odel8968/Band-on-the-Run/fullscale_ver0.7/ESP32MPU9250Madgwick.cpp
  delay(500);

  Serial.println("MPU9250 9-axis motion sensor...");
  uint8_t c = readByte(MPU9250_ADDRESS, WHO_AM_I_MPU9250);  // Read WHO_AM_I register for MPU-9250
  Serial.print("MPU9250 "); Serial.print("I AM "); Serial.print(c, HEX); Serial.print(" I should be "); Serial.println(0x71, HEX);

  if(c != 0x71) //if no connection
    return 0;

  delay(1000);
  
  MPU9250SelfTest(SelfTest); // Start by performing self test and reporting values
  Serial.print("x-axis self test: acceleration trim within : "); Serial.print(SelfTest[0],1); Serial.println("% of factory value");
  Serial.print("y-axis self test: acceleration trim within : "); Serial.print(SelfTest[1],1); Serial.println("% of factory value");
  Serial.print("z-axis self test: acceleration trim within : "); Serial.print(SelfTest[2],1); Serial.println("% of factory value");
  Serial.print("x-axis self test: gyration trim within : "); Serial.print(SelfTest[3],1); Serial.println("% of factory value");
  Serial.print("y-axis self test: gyration trim within : "); Serial.print(SelfTest[4],1); Serial.println("% of factory value");
  Serial.print("z-axis self test: gyration trim within : "); Serial.print(SelfTest[5],1); Serial.println("% of factory value");

  delay(1000);
  
  getAres();
  getGres();
  getMres();

  Serial.println(" Calibrate gyro and accel");
  accelgyrocalMPU9250(gyroBias, accelBias); //CAUSING PROBLEMS
  Serial.println("accel biases (mg)"); Serial.println(1000.*accelBias[0]); Serial.println(1000.*accelBias[1]); Serial.println(1000.*accelBias[2]);
  
  Serial.println("gyro biases (dps)"); Serial.println(gyroBias[0]); Serial.println(gyroBias[1]); Serial.println(gyroBias[2]);
  delay(1000);
   
  initMPU9250(); 
  Serial.println("MPU9250 initialized for active data mode...."); // Initialize device for active mode read of acclerometer, gyroscope, and temperature
  
  byte d = readByte(AK8963_ADDRESS, WHO_AM_I_AK8963);  // Read WHO_AM_I register for AK8963
  Serial.print("AK8963 "); Serial.print("I AM "); Serial.print(d, HEX); Serial.print(" I should be "); Serial.println(0x48, HEX);

  if(d != 0x48) //if no connection
    return 0;
    
  delay(1000);
  
  initAK8963(magCalibration);
  Serial.println("AK8963 initialized for active data mode....");
  
  magcalMPU9250(magBias, magScale, fixedMagBias, fixedMagScale, fixedCalibration);
  Serial.println("AK8963 mag biases (mG)"); Serial.println(magBias[0]); Serial.println(magBias[1]); Serial.println(magBias[2]); 
  Serial.println("AK8963 mag scale (mG)"); Serial.println(magScale[0]); Serial.println(magScale[1]); Serial.println(magScale[2]); 
   
  Serial.println("Calibration values: ");
  Serial.print("X-Axis sensitivity adjustment value "); Serial.println(magCalibration[0], 2);
  Serial.print("Y-Axis sensitivity adjustment value "); Serial.println(magCalibration[1], 2);
  Serial.print("Z-Axis sensitivity adjustment value "); Serial.println(magCalibration[2], 2);

  Serial.println("MPU9250 Ready.");

  return 1;

}

// Reads the IMU and Calculates the new Yaw/Pitch/Roll of the vehicle
int updateHeading(float headings[3])
{
  int16_t MPU9250Data[7];

  if (readByte(MPU9250_ADDRESS, INT_STATUS) & 0x01) //read int flag for data ready
  {
    uint8_t c = readByte(MPU9250_ADDRESS, WHO_AM_I_MPU9250);
    byte d = readByte(AK8963_ADDRESS, WHO_AM_I_AK8963);

    if( (c != 0x71) || (d != 0x48) ) //if no connection
      return 0;
      
    readMPU9250Data(MPU9250Data); // INT cleared on any read
   
    // Now we'll calculate the accleration value into actual g's
    ax = (float)MPU9250Data[0]*aRes - accelBias[0];  // get actual g value, this depends on scale being set
    ay = (float)MPU9250Data[1]*aRes - accelBias[1];   
    az = (float)MPU9250Data[2]*aRes - accelBias[2];  
    
    // Calculate the gyro value into actual degrees per second
    gx = (float)MPU9250Data[4]*gRes;  // get actual gyro value, this depends on scale being set
    gy = (float)MPU9250Data[5]*gRes;  
    gz = (float)MPU9250Data[6]*gRes; 
  
    //bool newMagData = (readByte(AK8963_ADDRESS, AK8963_ST1) & 0x01);
    if(readByte(AK8963_ADDRESS, AK8963_ST1) & 0x01) 
    { // wait for magnetometer data ready bit to be set
      readMagData(magCount);  // Read the x/y/z adc values
  
    // Calculate the magnetometer values in milliGauss
    // Include factory calibration per data sheet and user environmental corrections
      mx = (float)magCount[0]*mRes*magCalibration[0] - magBias[0];  // get actual magnetometer value, this depends on scale being set
      my = (float)magCount[1]*mRes*magCalibration[1] - magBias[1];  
      mz = (float)magCount[2]*mRes*magCalibration[2] - magBias[2];  

      mx *= magScale[0];
      my *= magScale[1];
      mz *= magScale[2]; 
    }
    
    for(uint8_t i = 0; i < 10; i++) // iterate 10 times per data read
    { 
      Now = micros();
      
      deltat = ((Now - lastUpdate)/1000000.0f); // set integration time by time elapsed since last filter update
      
      //Serial.printf("Last Quaternion calculation: %d microseconds\n", Now - lastUpdate);
      lastUpdate = Now;
      
      sum += deltat; // sum for averaging filter update rate
      sumCount++;
  
      MadgwickQuaternionUpdate(-ax, ay, az, gx*pi/180.0f, -gy*pi/180.0f, -gz*pi/180.0f,  my,  -mx, mz);
    }
 } 

  a12 =   2.0f * (q[1] * q[2] + q[0] * q[3]);
  a22 =   q[0] * q[0] + q[1] * q[1] - q[2] * q[2] - q[3] * q[3];
  a31 =   2.0f * (q[0] * q[1] + q[2] * q[3]);
  a32 =   2.0f * (q[1] * q[3] - q[0] * q[2]);
  a33 =   q[0] * q[0] - q[1] * q[1] - q[2] * q[2] + q[3] * q[3];
  
  pitch = -asin(a32);
  roll  = atan2(a31, a33);
  yaw   = atan2(a12, a22);
  pitch *= 180.0f / pi;
  yaw   *= 180.0f / pi; 
  yaw   += 6.08f; // Declination at Moscow ID is -6.08 degrees 17 October 2020
  if(yaw < 0) yaw   += 360.0f; // Ensure yaw stays between 0 and 360
  roll  *= 180.0f / pi;
  lin_ax = ax + a31;
  lin_ay = ay + a32;
  lin_az = az - a33;
  
  count = millis(); 
  sumCount = 0;
  sum = 0;

  headings[0] = yaw;
  headings[1] = pitch;
  headings[2] = roll;

  return 1;
}
